# Series

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sb

In [5]:
li = [1,'smith',3,'john']
li

[1, 'smith', 3, 'john']

In [7]:
li = [1,'smith',3,'john']
s = pd.Series(li)
s

0        1
1    smith
2        3
3     john
dtype: object

In [9]:
type(s)

pandas.core.series.Series

In [10]:
s[1]

'smith'

In [11]:
s[2]

3

In [12]:
s[3]

'john'

In [13]:
s.values

array([1, 'smith', 3, 'john'], dtype=object)

In [16]:
ind = ['A','B','C','D']
s1 = pd.Series(li,index = ind)
s1

A        1
B    smith
C        3
D     john
dtype: object

In [17]:
s1['A']

1

In [18]:
s1['D']

'john'

# series
=> one dimensional object which has a default indexing starting from 0.

In [20]:
s

0        1
1    smith
2        3
3     john
dtype: object

## DataFrame

In [21]:
dic = {'name' : ['Akshay','naveena','naina','nithin'],
       'age': [23,30,6,32],
       'salary': [10000,20000,40000,500000],
       'gender': ['male','female','female','male']}

dic

{'name': ['Akshay', 'naveena', 'naina', 'nithin'],
 'age': [23, 30, 6, 32],
 'salary': [10000, 20000, 40000, 500000],
 'gender': ['male', 'female', 'female', 'male']}

In [22]:
type(dic)

dict

In [23]:
df = pd.DataFrame(dic)
df

      name  age  salary  gender
0   Akshay   23   10000    male
1  naveena   30   20000  female
2    naina    6   40000  female
3   nithin   32  500000    male

# Data Frame
-- 2Dimensional data structure where data is present in the form of rows and columns. 
-- rows will have default index starting from 0.
-- Columns will also have default index starting from 0.

In [26]:
df1 = pd.DataFrame(li)
df1

       0
0      1
1  smith
2      3
3   john

### Data Frame and series connection

In [25]:
df['salary']

0     10000
1     20000
2     40000
3    500000
Name: salary, dtype: int64

## Every individual column of a Data Frame is always a series

In [27]:
df.iloc[0]

name      Akshay
age           23
salary     10000
gender      male
Name: 0, dtype: object

## Every individual row of a dataframe is always a series

In [28]:
df.iloc[4]

IndexError: single positional indexer is out-of-bounds

In [29]:
df.iloc[3]

name      nithin
age           32
salary    500000
gender      male
Name: 3, dtype: object

## Series is the core of the any DataFrame object

In [30]:
df

      name  age  salary  gender
0   Akshay   23   10000    male
1  naveena   30   20000  female
2    naina    6   40000  female
3   nithin   32  500000    male

In [31]:
type(df)

pandas.core.frame.DataFrame

data = pd.read_csv(r'') it reads the csv file